{
    "vulnerabilities": [
        {
            "id": 1,
            "name": "SQL Injection",
            "description": "Permite a un atacante interferir con las consultas que realiza una aplicacion hacia su base de datos.",
            "impact": "Robo de informacion confidencial, perdida en la integridad de los datos e interrupcion del servicio",
            "remediation": "Usar de consultas preparadas, Utilizar ORM (Object-Relational Mapping), Validar todas las entradas del usuario esperando que lo datos ingresados sean del formato esperado.",
            "mitre": "tactic: Initial Access, technique: T1190, url: https://attack.mitre.org/techniques/T1190/"
        },
        {
            "id": 2,
            "name": "Cross-Site Scripting (XSS)",
            "description": "Permite a un atacante inyectar codigo malicioso mediante scripts en una pagina web vistada por otros usuarios",
            "impact": "Robo de cookies, Robo de crendenciales, Redireccionamiento malicioso, Desconfiguracion del sitio web",
            "remediation": "Transformar los caracteres especiales en la salida del codigo, Validar y limpiar las entradas del usuario",
            "mitre": "tactic: Initial Access, technique: T1059.007, url: https://attack.mitre.org/techniques/T1059/007/"
            
        },
        {
            "id": 3,
            "name": "Denegacion de Servicio (DoS)",
            "description": "Permite a un atacante interrumpir el funcionamiento normal de alguna aplicacion",
            "impact": "Interrupcion del servicio, degradacion del rendimiento.",
            "remediation": "Implementar balanceo de carga, Utilizar servicios de mitigacion de DDoS, Monitorear y limitar el trafico sospechoso.",
            "mitre": "'tactic': Impact, technique: T1499,url: https://attack.mitre.org/techniques/T1499/"
            
        },
        {
            "id": 4,
            "name": "Ataque por diccionario",
            "description": "Permite a un atacante descifrar contrasenas mediante una lista predefinida con las palabras mas comunes, con esperanza de acceder a la cuenta de su objetivo.",
            "impact": "Acceso autorizado permitiendo el acceso a la inforacion sensible y realizar acciones en nombre del usuario",
            "remediation": "Politicas de contrasenas mas robustas, autenticacion multifactor, limitar el numero de intentos de inicios de sesion, monitoreo y alertas.",
            "mitre": "'tactic': 'Credential Access', 'technique': 'T1110.001', 'url': 'https://attack.mitre.org/techniques/T1110/001/'"
        }
    ]
}